### Importing MySQL etc.

In [29]:
import numpy as np
import pandas as pd
import mysql.connector
import sqlalchemy as sqlalc

In [27]:
myDb = mysql.connector.connect(
    host = "localhost",
    user = "root",
    passwd = "vincent28",
    use_pure = True,
    database = "pandas_test"
)
query = "select * from employees"
alamatDb = "mysql://root:vincent28@localhost:3306/pandas_test"
df = pd.read_sql(query, alamatDb)
df

   id     nama               email               waktu
0   1   Asnawi  asnawi@yahoo.co.id 2019-12-09 09:29:39
1   2    Bagas   bagasadi@yahoo.id 2019-12-09 09:29:39
2   3     Evan     evandd@yahoo.id 2019-12-09 09:29:39
3   4  Osvaldo    osvaldo@yahoo.id 2019-12-09 09:29:39

### SQL Alchemy Engine

In [30]:
con = sqlalc.create_engine(alamatDb)
dfAlc = pd.read_sql(query, con)
dfAlc

   id     nama               email               waktu
0   1   Asnawi  asnawi@yahoo.co.id 2019-12-09 09:29:39
1   2    Bagas   bagasadi@yahoo.id 2019-12-09 09:29:39
2   3     Evan     evandd@yahoo.id 2019-12-09 09:29:39
3   4  Osvaldo    osvaldo@yahoo.id 2019-12-09 09:29:39